app/controllers/chemicals_controller.rb

SELECT "chemicals".* FROM "chemicals"
---
  def index
    @chemicals = Chemical.all

SELECT "chemicals".* FROM "chemicals" WHERE "chemicals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chemical = Chemical.find(params[:id])