app/controllers/lures_controller.rb

  def index
    @lures = Lure.all
---
SELECT "lures".* FROM "lures"

  def show
    @lure = Lure.find(params[:id])
---
SELECT "lures".* FROM "lures" WHERE "lures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]