app/controllers/traps_controller.rb

  def index
    @traps = Trap.all
---
SELECT "traps".* FROM "traps"

  def show
    @trap = Trap.find(params[:id])
---
SELECT "traps".* FROM "traps" WHERE "traps"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]